# PyCity Schools Assignment 4

In [1]:
import pandas as pd
from pathlib import Path

In [2]:
#THIS IS TO KNOW THE PATH OF EVERY CSV FILE
school_data=Path("Resources/schools_complete.csv")
students_data=Path("Resources/students_complete.csv")

In [3]:
#THIS IS TO OPEN EVERY CSV.FILE
school_data_pd=pd.read_csv(school_data)
students_data_pd=pd.read_csv(students_data)

In [42]:
school_data_pd.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [44]:
students_data_pd.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [37]:
#i want to know the name of every columns to calculate
school_data_pd.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [38]:
students_data_pd.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

SCHOOLS AND STUDENTS DATA COMPLETE

In [6]:
#HERE, I MERGE BOTH CSV FILE IN ONE TO CONSOLIDATE ALL THE INFORMATION IN ONE FILE.
school_students_complete=pd.merge(students_data_pd,school_data_pd,how="left",on=["school_name","school_name"])
school_students_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [47]:
school_students_complete["mean_score"]=(school_students_complete["reading_score"]+school_students_complete["math_score"])/2
school_students_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,mean_score
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,72.5
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,77.5
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,75.0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,62.5
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,90.5

DISTRICT SUMMARY

In [30]:
school_count=school_data_pd["type"].count()
school_count

15

In [32]:
#here, we count every students of every schools and we can see that we have 39170 students.
students_count=school_students_complete["student_name"].count()
students_count

39170

In [33]:
school_budget=school_data_pd["budget"].sum()
school_budget

24649428

In [61]:
mean_math=students_data_pd["math_score"].mean()
mean_math

78.98537145774827

In [41]:
mean_reading=students_data_pd["reading_score"].mean()
mean_reading

81.87784018381414

In [46]:
passing_math_count=school_students_complete[(school_students_complete["math_score"]>=70)].count()["student_name"]
passing_math_perc=passing_math_count/float(students_count)*100
passing_math_perc

74.9808526933878

In [48]:
passing_reading_count=school_students_complete[(school_students_complete["reading_score"]>=70)].count()["student_name"]
passing_reading_perc=passing_reading_count/float(students_count)*100
passing_reading_perc

85.80546336482001

In [50]:
passing_total_count=school_students_complete[(school_students_complete["math_score"]>=70)&(school_students_complete["reading_score"]>=70)].count()["student_name"]
passing_total_perc=passing_total_count/float(students_count)*100
passing_total_perc

65.17232575950983

In [60]:
district_summary=pd.DataFrame([{"Total Number of Unique Schools":school_count,
                              "Total Students":students_count,
                              "Total Budget":school_budget,
                              "Average Math Score":mean_math,
                              "Average Reading Score":mean_reading,
                              "% Passing Math":passing_math_perc,
                              "% Passing Reading":passing_reading_perc,
                              "% Overall Passing": passing_total_perc}])

district_summary["Total Students"]=district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"]=district_summary["Total Budget"].map("${:,}".format)
district_summary["Average Math Score"]=district_summary["Average Math Score"].map("{:.2f}%".format)
district_summary["Average Reading Score"]=district_summary["Average Reading Score"].map("{:.2f}%".format)
district_summary["% Passing Math"]=district_summary["% Passing Math"].map("{:.2f}%".format)
district_summary["% Passing Reading"]=district_summary["% Passing Reading"].map("{:.2f}%".format)
district_summary["% Overall Passing"]=district_summary["% Overall Passing"].map("{:.2f}%".format)

district_summary.head()

,Total Number of Unique Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428",78.99%,81.88%,74.98%,85.81%,65.17%

Schools Summary

In [68]:
#Schools Names
name_schools=school_data_pd["school_name"].unique()
name_schools

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [69]:
#District Types
District_type=school_data_pd["type"].unique()
District_type

array(['District', 'Charter'], dtype=object)

In [105]:
#Students per School
students_per_school=school_students_complete.groupby("school_name")
resume_stu_schol=pd.DataFrame(students_per_school["student_name"].count())
resume_stu_schol.head()

                      student_name
school_name
Bailey High School            4976
Cabrera High School           1858
Figueroa High School          2949
Ford High School              2739
Griffin High School           1468

In [118]:
#Budget per school
budget_per_school=school_data_pd.groupby("school_name")
resume_budget_sch=pd.DataFrame(budget_per_school["budget"].sum())
resume_budget_sch.head()

                       budget
school_name
Bailey High School    3124928
Cabrera High School   1081356
Figueroa High School  1884411
Ford High School      1763916
Griffin High School    917500

In [125]:
budget_per_studant=school_data_pd.groupby("school_name")
budget_per_studant=pd.DataFrame(budget_per_school["budget"].sum()/students_per_school["student_name"].count())
budget_per_studant.head()

                          0
school_name
Bailey High School    628.0
Cabrera High School   582.0
Figueroa High School  639.0
Ford High School      644.0
Griffin High School   625.0

In [137]:
resume=pd.DataFrame.merge(resume_budget_sch,resume_stu_schol,on="school_name",how="inner")
resume.head()

                       budget  student_name
school_name
Bailey High School    3124928          4976
Cabrera High School   1081356          1858
Figueroa High School  1884411          2949
Ford High School      1763916          2739
Griffin High School    917500          1468

In [138]:
resume["Budget Per Student"]=budget_per_school["budget"].sum()/students_per_school["student_name"].count()
resume.head()

                       budget  student_name  Budget Per Student
school_name
Bailey High School    3124928          4976               628.0
Cabrera High School   1081356          1858               582.0
Figueroa High School  1884411          2949               639.0
Ford High School      1763916          2739               644.0
Griffin High School    917500          1468               625.0

In [141]:
average_math=students_data_pd.groupby("school_name")
resume["Average Math Score"]=average_math["math_score"].mean()
resume.head()

,budget,student_name,Budget Per Student,Average Math Score
school_name,,,,
Bailey High School,3124928,4976,628.0,77.048432
Cabrera High School,1081356,1858,582.0,83.061895
Figueroa High School,1884411,2949,639.0,76.711767
Ford High School,1763916,2739,644.0,77.102592
Griffin High School,917500,1468,625.0,83.351499

In [142]:
average_reading=students_data_pd.groupby("school_name")
resume["Average Reading Score"]=average_math["reading_score"].mean()
resume.head()

,budget,student_name,Budget Per Student,Average Math Score,Average Reading Score
school_name,,,,,
Bailey High School,3124928,4976,628.0,77.048432,81.033963
Cabrera High School,1081356,1858,582.0,83.061895,83.975780
Figueroa High School,1884411,2949,639.0,76.711767,81.158020
Ford High School,1763916,2739,644.0,77.102592,80.746258
Griffin High School,917500,1468,625.0,83.351499,83.816757